/**
 * @file: 错误代码提示函数
 * @author: Yidadaa(18/12/25 fix by hzy)
 */

const errorCode = {
  0: '糟糕，出现了未知错误',
  102: '请输入验证码',
  104: '验证码输入错误，你真的是人类吗？',

  201: '登录过期了，重新登录下吧',
  202: '我也不知道哪里出错了，快去问问开发者',
  203: '学校网站好像炸了，喝杯Java吧',
  204: '请检查账号密码是否正确',
  205: '服务器崩了，赶紧去喷开发者，让他们快去修bug',
  206: '请求出错了，代码中出了一行叛徒',
  
  108: '信息门户好像炸了，喝杯茶吧',
  109: '一卡通网站好像炸了，喝杯牛奶吧',
  110: '学校网站好像炸了，喝杯快乐水吧'
}

/**
 * 将错误代码转换为人类可阅读的文字
 * @param {Number} code 错误代码
 * @return {String} error msg
 */
export function errorCode2Msg (code = 0) {
  return errorCode[code] || errorCode[0]
}
